In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings("ignore")

In [20]:
# SQLAlchemy connection string format:
# postgresql+psycopg2://user:password@host:port/dbname

DATABASE_URL = (
    "postgresql+psycopg2://neondb_owner:npg_CeS9fJg2azZD"
    "@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech:5432/neondb"
    "?sslmode=require"
)

# Create engine and establish connection
engine = create_engine(DATABASE_URL)

In [3]:
# Load raw data 
df = pd.read_csv("sat-results.csv")
df.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 11 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              493 non-null    object
 1   SCHOOL NAME                      493 non-null    object
 2   Num of SAT Test Takers           493 non-null    object
 3   SAT Critical Reading Avg. Score  493 non-null    object
 4   SAT Math Avg. Score              493 non-null    object
 5   SAT Writing Avg. Score           493 non-null    object
 6   SAT Critical Readng Avg. Score   493 non-null    object
 7   internal_school_id               493 non-null    int64
 8   contact_extension                388 non-null    object
 9   pct_students_tested              376 non-null    object
 10  academic_tier_rating             402 non-null    float64
dtypes: float64(1), int64(1), object(9)
memory usage: 42.5+ KB

In [5]:
# Normalize column names
new_col_names=[]
for col in df.columns:
        stripped_name=col.lower().strip().replace(' ','_').replace('.', '')
        new_col_names.append(stripped_name)
df.columns=new_col_names


df.head()

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,sat_critical_readng_avg_score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0

In [6]:
# Drop the column with the misspelled and duplicated name

df.drop(columns=['sat_critical_readng_avg_score'], inplace=True)
print(df.columns)

Index(['dbn', 'school_name', 'num_of_sat_test_takers',
       'sat_critical_reading_avg_score', 'sat_math_avg_score',
       'sat_writing_avg_score', 'internal_school_id', 'contact_extension',
       'pct_students_tested', 'academic_tier_rating'],
      dtype='object')

In [7]:
print(df.dtypes)

dbn                                object
school_name                        object
num_of_sat_test_takers             object
sat_critical_reading_avg_score     object
sat_math_avg_score                 object
sat_writing_avg_score              object
internal_school_id                  int64
contact_extension                  object
pct_students_tested                object
academic_tier_rating              float64
dtype: object

In [8]:
# Remove the '%' symbol
df['pct_students_tested'] = df['pct_students_tested'].str.rstrip('%')

In [9]:
cols_to_convert = [
    'num_of_sat_test_takers',
    'sat_critical_reading_avg_score',
    'sat_math_avg_score',
    'sat_writing_avg_score'
]

for col in cols_to_convert:
    df[col] = pd.to_numeric(df[col], errors='coerce').astype('Int64')
print(df.dtypes)

dbn                                object
school_name                        object
num_of_sat_test_takers              Int64
sat_critical_reading_avg_score      Int64
sat_math_avg_score                  Int64
sat_writing_avg_score               Int64
internal_school_id                  int64
contact_extension                  object
pct_students_tested                object
academic_tier_rating              float64
dtype: object

In [11]:
# Convert to float (numeric type)

df['pct_students_tested'] = pd.to_numeric(df['pct_students_tested'], errors='coerce')

# Convert to fraction (e.g., 78 becomes 0.78)

df['pct_students_tested'] = df['pct_students_tested'] / 100

In [12]:
df

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,218160,x345,0.78,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,427826,x123,0.92,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,672714,x123,0.92,2.0
...,...,...,...,...,...,...,...,...,...,...
488,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,863765,NaN,0.92,1.0
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,937579,x234,NaN,NaN
490,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,296405,x123,0.78,2.0
491,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,892839,NaN,0.92,2.0
492,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,277389,x345,0.92,NaN

In [16]:
# Filter for valid SAT scores only
new_df = df[
    (df['sat_critical_reading_avg_score'].between(200, 800)) &
    (df['sat_math_avg_score'].between(200, 800)) &
    (df['sat_writing_avg_score'].between(200, 800))
]

In [17]:
new_df

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,218160,x345,0.78,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,427826,x123,0.92,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,672714,x123,0.92,2.0
...,...,...,...,...,...,...,...,...,...,...
488,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,863765,NaN,0.92,1.0
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,937579,x234,NaN,NaN
490,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,296405,x123,0.78,2.0
491,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,892839,NaN,0.92,2.0
492,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,277389,x345,0.92,NaN

In [15]:
print(df.columns.tolist())

['dbn', 'school_name', 'num_of_sat_test_takers', 'sat_critical_reading_avg_score', 'sat_math_avg_score', 'sat_writing_avg_score', 'internal_school_id', 'contact_extension', 'pct_students_tested', 'academic_tier_rating']

In [18]:
print(new_df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 430 entries, 0 to 492
Data columns (total 10 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   dbn                             430 non-null    object
 1   school_name                     430 non-null    object
 2   num_of_sat_test_takers          430 non-null    Int64
 3   sat_critical_reading_avg_score  430 non-null    Int64
 4   sat_math_avg_score              430 non-null    Int64
 5   sat_writing_avg_score           430 non-null    Int64
 6   internal_school_id              430 non-null    int64
 7   contact_extension               341 non-null    object
 8   pct_students_tested             325 non-null    float64
 9   academic_tier_rating            358 non-null    float64
dtypes: Int64(4), float64(2), int64(1), object(3)
memory usage: 38.6+ KB
None

In [19]:
print(new_df.describe())

       num_of_sat_test_takers  sat_critical_reading_avg_score  \
count                   430.0                           430.0
mean               111.848837                       400.92093
std                155.592298                       56.259375
min                       6.0                           279.0
25%                      42.0                           368.0
50%                      63.0                           391.0
75%                     97.75                           416.0
max                    1277.0                           679.0

       sat_math_avg_score  sat_writing_avg_score  internal_school_id  \
count               430.0                  430.0          430.000000
mean            413.34186             393.893023       575737.548837
std             64.141429              58.137067       260104.189222
min                 312.0                  286.0       102816.000000
25%                 372.0                  360.0       350811.750000
50%                 395.0                  382.0       606638.000000
75%                 437.0                  411.0       793771.500000
max                 735.0                  682.0       999398.000000

       pct_students_tested  academic_tier_rating
count           325.000000            358.000000
mean              0.848062              2.561453
std               0.057518              1.120409
min               0.780000              1.000000
25%               0.780000              2.000000
50%               0.850000              3.000000
75%               0.920000              4.000000
max               0.920000              4.000000

In [21]:
new_df.to_sql(
    name='haritha_sat_results',       
    con=engine,     
    schema='nyc_schools',
    if_exists='replace',    
    index=False            
)

430

In [22]:
print(new_df.isnull().sum())

dbn                                 0
school_name                         0
num_of_sat_test_takers              0
sat_critical_reading_avg_score      0
sat_math_avg_score                  0
sat_writing_avg_score               0
internal_school_id                  0
contact_extension                  89
pct_students_tested               105
academic_tier_rating               72
dtype: int64

In [23]:
new_df['pct_students_tested'].fillna(0, inplace=True)

In [24]:
new_df.drop(columns=['contact_extension'], inplace=True)

In [25]:
new_df

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg_score,sat_math_avg_score,sat_writing_avg_score,internal_school_id,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,218160,0.78,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,268547,0.00,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,236446,0.00,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,427826,0.92,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,672714,0.92,2.0
...,...,...,...,...,...,...,...,...,...
488,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,863765,0.92,1.0
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,937579,0.00,NaN
490,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,296405,0.78,2.0
491,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,892839,0.92,2.0
492,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,277389,0.92,NaN

In [27]:
# Upload to PostgreSQL
new_df.to_sql(
    name='haritha_sat_results_cleaned',       
    con=engine,     
    schema='nyc_schools',
    if_exists='replace',    
    index=False            
)

430